I did it as you did it:
- 2 files (`main.tf`, `provider.tf`)
- Put exactly what you had verbatim:
```bash
christianb@unifi terraform-provider-artifactory % terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # artifactory_local_repository.test-provider_local will be created
  + resource "artifactory_local_repository" "test-provider_local" {
      + blacked_out                     = (known after apply)
      + checksum_policy_type            = (known after apply)
      + docker_api_version              = (known after apply)
      + enable_file_lists_indexing      = (known after apply)
      + excludes_pattern                = (known after apply)
      + force_nuget_authentication      = (known after apply)
      + handle_releases                 = false
      + handle_snapshots                = true
      + id                              = (known after apply)
      + includes_pattern                = (known after apply)
      + key                             = "test-provider-local"
      + max_unique_snapshots            = (known after apply)
      + max_unique_tags                 = (known after apply)
      + package_type                    = "maven"
      + repo_layout_ref                 = (known after apply)
      + snapshot_version_behavior       = (known after apply)
      + suppress_pom_consistency_checks = (known after apply)
      + xray_index                      = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

artifactory_local_repository.test-provider_local: Creating...
artifactory_local_repository.test-provider_local: Creation complete after 2s [id=test-provider-local]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```